Revit 2027 API
ParameterUtils.GetDefinition Method
 Gets the parameter definition for a built-in Revit parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static InternalDefinition GetDefinition(
	ForgeTypeId parameterTypeId
)
Public Shared Function GetDefinition (
	parameterTypeId As ForgeTypeId
) As InternalDefinition
public:
static InternalDefinition^ GetDefinition(
	ForgeTypeId^ parameterTypeId
)
static member GetDefinition :
        parameterTypeId : ForgeTypeId -> InternalDefinition
Parameters
parameterTypeId ForgeTypeId
 The built-in parameter id.
Return Value
InternalDefinition
 Parameter definition of built-in parameter.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterUtils Class
Autodesk.Revit.DB Namespace